//题目描述
//楚乔、宇文玥和燕洵在日本旅行，经过了几天的游玩之后，钱包里出现了大量硬币，楚乔决定用钱包里的硬币为宇文玥和燕洵在自动贩卖机买水。楚乔的钱包里有1元、5元、10元、50元、100元和500元硬币各C1, C5, C10, C50, C100, C500枚。现在要用这些硬币来到自动贩卖机买价格为A的饮料，假设自动贩卖机所需的硬币金额必须是刚刚好，不能多也不能少，最少需要多少枚硬币？
//限制条件
//0≤ C1, C5, C10, C50, C100, C500≤1000000000
//0≤A≤1000000000
//依次输入C1, C5, C10, C50, C100, C500和A，以空格分隔，输出最少所需硬币数，如果该金额不能由所给硬币凑出，则返回NOWAY
//输入描述 :
//依次输入C1, C5, C10, C50, C100, C500和A，以空格分隔
//输出描述 :
//输出最少所需硬币数，如果该金额不能由所给硬币凑出，则返回NOWAY
//#include<stdio.h>
//int main()
//{
//	int c1, c5, c10, c50, c100, c500, a, b, c, d, e, f, g, zz;
//	scanf("%d %d %d %d %d %d %d", &c1, &c5, &c10, &c50, &c100, &c500, &a);
//	b = a / 500;
//	a = a - 500 * b;
//	c = a / 100;
//	a = a - 100 * c;
//	d = a / 50;
//	a = a - 50 * d;
//	e = a / 10;
//	a = a - 10 * e;
//	f = a / 5;
//	a = a - 5 * f;
//	g = a / 1;
//	if ((g <= c1) && (f <= c5) && (e <= c10) && (d <= c50) && (c <= c100) && (b <= c500))
//	{
//		zz = g + f + e + d + c + b; printf("%d", zz);
//	}
//	else printf("NOWAY");
//	return 0;
//}
