//题目描述
//小明去附近的水果店买橙子，水果商贩只提供整袋购买，有每袋6个和每袋8个的包装（包装不可拆分）。可是小明只想购买恰好n个橙子，并且尽量少的袋数方便携带。如果不能购买恰好n个橙子，小明将不会购买。
//
//输入描述 :
//输入一个整数n，表示小明想要购买n（1≤n≤100）个橙子
//输出描述 :
//输出一个整数表示最少需要购买的袋数，如果不能买恰好n个橙子则输出 - 1
//
//
//#include<iostream>
//using namespace std;
//int main(){
//	int n;
//	cin >> n;
//	if (n % 2 != 0 || n<6)
//		cout << -1;
//	else{
//		int min = 100;
//		for (int i = 0; i<13; i++){
//			for (int j = 0; j<17; j++){
//				if (8 * i + 6 * j == n)
//					min = i + j;
//			}
//		}
//		cout << min << endl;
//	}
//}
